In [1]:
import numpy as np 
import pandas as pd

In [2]:
dic1 = {
    
    'Name': ['Alice', 'Bob', 'Charlie'],
    'marks': [92,56,45],
    'city': ['rampus', 'kolkata', 'Chehe']
}

In [3]:
df  = pd.DataFrame(dic1)

In [4]:
df

      Name  marks     city
0    Alice     92   rampus
1      Bob     56  kolkata
2  Charlie     45    Chehe

In [5]:
df.to_csv("friend.csv")

In [6]:
df.to_csv("friends_index_false.csv", index=False)

In [7]:
df.head(2)

    Name  marks     city
0  Alice     92   rampus
1    Bob     56  kolkata

In [8]:
df.tail(1)

      Name  marks   city
2  Charlie     45  Chehe

In [9]:
df.describe()

           marks
count   3.000000
mean   64.333333
std    24.583192
min    45.000000
25%    50.500000
50%    56.000000
75%    74.000000
max    92.000000

In [10]:
harry = pd.read_csv('harry.csv', delimiter=';')

In [11]:
harry

  Train no  speed       city
0    harry     12     rampur
1    rohan     32    kolkata
2   skillf     24   bareilly
3    shubh     14  antiantes

In [12]:
harry['speed'][0]= 100

/var/folders/nr/gk1ym8kd65ld4t_zc5wp71p40000gn/T/ipykernel_58763/259263009.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['speed'][0]= 100

In [13]:
harry

  Train no  speed       city
0    harry    100     rampur
1    rohan     32    kolkata
2   skillf     24   bareilly
3    shubh     14  antiantes

In [14]:
harry.to_csv('harry1.csv')

In [15]:
dic2 = {
    
    "name":['ayush', 'chalise','raja'],
    "rollno":[1,2,3],
    "class": ['seven','eight','nine']

    
}

In [16]:
ac = pd.DataFrame(dic2)

In [17]:
ac

      name  rollno  class
0    ayush       1  seven
1  chalise       2  eight
2     raja       3   nine

In [18]:
ac['rollno'][0]

1

In [19]:
ac['rollno'][0] = 158

/var/folders/nr/gk1ym8kd65ld4t_zc5wp71p40000gn/T/ipykernel_58763/190525654.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ac['rollno'][0] = 158

In [20]:
ac

      name  rollno  class
0    ayush     158  seven
1  chalise       2  eight
2     raja       3   nine

In [21]:
#fixed with other from top
harry.to_csv('harry1.csv')

In [22]:
harry

  Train no  speed       city
0    harry    100     rampur
1    rohan     32    kolkata
2   skillf     24   bareilly
3    shubh     14  antiantes

In [23]:
harry

  Train no  speed       city
0    harry    100     rampur
1    rohan     32    kolkata
2   skillf     24   bareilly
3    shubh     14  antiantes

In [24]:
harry.index= ['first', 2 , 'third', 4]

In [25]:
harry

      Train no  speed       city
first    harry    100     rampur
2        rohan     32    kolkata
third   skillf     24   bareilly
4        shubh     14  antiantes

In [28]:
ser = pd.Series(np.random.rand(25))

In [29]:
ser

0     0.456812
1     0.647749
2     0.469859
3     0.631251
4     0.003234
5     0.276168
6     0.565080
7     0.411178
8     0.045145
9     0.795505
10    0.573691
11    0.663724
12    0.394164
13    0.697648
14    0.106723
15    0.978294
16    0.100935
17    0.140028
18    0.151068
19    0.089439
20    0.952833
21    0.646496
22    0.694971
23    0.572529
24    0.771813
dtype: float64

In [30]:
type(ser)

pandas.core.series.Series

In [33]:
newdf = pd.DataFrame(np.random.rand(226,7), index=np.arange(226))

In [38]:
newdf.head(5)

          0         1         2         3         4         5         6
0  0.150645  0.280140  0.761597  0.551455  0.410866  0.073635  0.849959
1  0.894601  0.611438  0.596625  0.687987  0.739962  0.754372  0.429594
2  0.493526  0.631785  0.815449  0.441285  0.418845  0.183874  0.979394
3  0.483610  0.601458  0.943187  0.467325  0.052006  0.028540  0.227013
4  0.967781  0.250716  0.482768  0.531281  0.240357  0.257921  0.982447

In [39]:
type(newdf)

pandas.core.frame.DataFrame